Thesis/OpenFOAM/Laminar_2D/OpenFOAM_2D_backward_step/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
convertToMeters 1;
 
 
vertices
(
    (1 0.0 0) //0
    (21 0.0 0) //1
    (0.0 1 0) //2
    (1 1 0) //3 
    (21 1 0) //4
    (0.0 2 0) //5 
    (1 2 0) //6
    (21 2 0) //7
 
    (1 0.0 0.05) //8
    (21 0.0 0.05) //9
    (0.0 1 0.05) //10
    (1 1 0.05) //11
    (21 1 0.05) //12
    (0.0 2 0.05) //13
    (1 2 0.05) //14
    (21 2 0.05) //15
);
 
blocks
(
    hex (0 1 4 3 8 9 12 11) (200 10 1) simpleGrading (1 1 1) //0
    hex (2 3 6 5 10 11 14 13) (10 10 1) simpleGrading (1 1 1) //1
    hex (3 4 7 6 11 12 15 14) (200 10 1) simpleGrading (1 1 1) //2
);
 
edges
(
);
 
boundary
(
    walls
    {
        type wall;
        faces
        (
            (6 5 13 14) // gora 0
            (7 6 14 15) // gora 1
            (2 3 11 10) // dol 0
            (0 1 9 8) // dol 1
            (3 0 8 11) // dol pion
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (5 2 10 13) 
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 7 15 12)
            (1 4 12 9)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (3 2 5 6)
            (4 3 6 7)
            (1 0 3 4)
 
            (11 14 13 10)
            (12 15 14 11)
            (9 12 11 8)
        );
    }
);
 
mergePatchPairs
(
);
 
// ************************************************************************* //

